tripmine253/massdrop_qmk/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
    if (udi_hid_mou_b_report_trans_ongoing) {
        return false;
    }

    memcpy(udi_hid_mou_report_trans, udi_hid_mou_report, UDI_HID_MOU_REPORT_SIZE);
    udi_hid_mou_b_report_valid         = false;
    udi_hid_mou_b_report_trans_ongoing = udd_ep_run(UDI_HID_MOU_EP_IN | USB_EP_DIR_IN, false, udi_hid_mou_report_trans, UDI_HID_MOU_REPORT_SIZE, udi_hid_mou_report_sent);

    return udi_hid_mou_b_report_trans_ongoing;
}

static void udi_hid_mou_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep) {
    UNUSED(status);
    UNUSED(nb_sent);
    UNUSED(ep);
    udi_hid_mou_b_report_trans_ongoing = false;
    if (udi_hid_mou_b_report_valid) {
        udi_hid_mou_send_report();
    }
}

#endif  // MOU

//********************************************************************************************
// RAW
//********************************************************************************************
#ifdef RAW

bool    udi_hid_raw_enable(void);
void    udi_hid_raw_disable(void);
bool    udi_hid_raw_setup(void);
uint8_t udi_hid_raw_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_raw = {
    .enable     = (bool (*)(void))udi_hid_raw_enable,
    .disable    = (void (*)(void))udi_hid_raw_disable,
    .setup      = (bool (*)(void))udi_hid_raw_setup,
    .getsetting = (uint8_t(*)(void))udi_hid_raw_getsetting,
    .sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_protocol;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_raw_report_set[UDI_HID_RAW_REPORT_SIZE];

//! Report to send
COMPILER_WORD_ALIGNED
uint8_t udi_hid_raw_report[UDI_HID_RAW_REPORT_SIZE];

//! Report to receive
COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_report_out[UDI_HID_RAW_REPORT_SIZE];

//! Report to receive, copy for App
COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_report_out_cp[UDI_HID_RAW_REPORT_SIZE];

volatile bool udi_hid_raw_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_report_trans[UDI_HID_RAW_REPORT_SIZE];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_raw_report_desc_t udi_hid_raw_report_desc = {{
    0x06, 0xBC, 0xFF,		// Usage Page (Drop mfgr specific)
    0x0A, 0x34, 0x02,		// Usage  (Drop mfgr specific)
	0xA1, 0x01,  			// Collection (Application)
    0x75, 0x08,              //   Report Size (8)
    0x15, 0x00,              //   Logical Minimum (0)
    0x26, 0xFF, 0x00,        //   Logical Maximum (0x00FF) = 255
    0x95, 0x40,              //     Report Count
    0x09, 0x01,              //     Usage (Input)
    0x81, 0x02,              //     Input (Data)
    0x95, 0x40,              //     Report Count
    0x09, 0x02,              //     Usage (Output)
    0x91, 0x02,              //     Output (Data)
    0xC0,                    // End Collection - Consumer Control
}};

static bool udi_hid_raw_setreport(void);
static void udi_hid_raw_setreport_valid(void);

static void udi_hid_raw_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

__attribute__((weak)) void raw_hid_receive(uint8_t *data, uint8_t length) {
    // Users should #include "raw_hid.h" in their own code
    // and implement this function there. Leave this as weak linkage
    // so users can opt to not handle data coming in.
}


/**
 * \brief Enable reception of out report
 *
 * \return \c 1 if function was successfully done, otherwise \c 0.
 */
static bool udi_hid_raw_report_out_enable(void);

bool udi_hid_raw_enable(void) {
    // Initialize internal values
    udi_hid_raw_rate                   = 0;
    udi_hid_raw_protocol               = 0;
    udi_hid_raw_b_report_trans_ongoing = false;
    memset(udi_hid_raw_report, 0, UDI_HID_RAW_REPORT_SIZE);
	if (!udi_hid_raw_report_out_enable())		// PS120919
		return false;
    return UDI_HID_RAW_ENABLE_EXT();
}

void udi_hid_raw_disable(void) { UDI_HID_RAW_DISABLE_EXT(); }

bool udi_hid_raw_setup(void) {
	return udi_hid_setup(&udi_hid_raw_rate, &udi_hid_raw_protocol, (uint8_t *)&udi_hid_raw_report_desc, udi_hid_raw_setreport);
}

uint8_t udi_hid_raw_getsetting(void) {
	return 0;
}

static bool udi_hid_raw_setreport(void) {
    if ((USB_HID_REPORT_TYPE_OUTPUT == (udd_g_ctrlreq.req.wValue >> 8)) && (0 == (0xFF & udd_g_ctrlreq.req.wValue)) && (UDI_HID_RAW_REPORT_SIZE == udd_g_ctrlreq.req.wLength)) {
        // Report OUT type on report ID 0 from USB Host (Should it be type FEATURE instead? ***TBD)
        udd_g_ctrlreq.payload      = udi_hid_raw_report_set;
        udd_g_ctrlreq.callback     = udi_hid_raw_setreport_valid;  // must call routine to transform setreport to LED state
        udd_g_ctrlreq.payload_size = UDI_HID_RAW_REPORT_SIZE;
        return true;
    }
    return false;
}

// Send IN Report
bool udi_hid_raw_send_report(uint8_t length) {
    if (!main_b_raw_enable) {
        return false;
    }

    if (udi_hid_raw_b_report_trans_ongoing) {
        return false;
    }

    memset(udi_hid_raw_report_trans, 0, UDI_HID_RAW_REPORT_SIZE);
    memcpy(udi_hid_raw_report_trans, udi_hid_raw_report, length);
    udi_hid_raw_b_report_trans_ongoing = udd_ep_run(UDI_HID_RAW_EP_IN | USB_EP_DIR_IN, false, udi_hid_raw_report_trans, UDI_HID_RAW_REPORT_SIZE, udi_hid_raw_report_sent);

    return udi_hid_raw_b_report_trans_ongoing;
}

// Send IN Report Callback
static void udi_hid_raw_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep) {
    UNUSED(status);
    UNUSED(nb_sent);
    UNUSED(ep);
    udi_hid_raw_b_report_trans_ongoing = false;
    //if (udi_hid_raw_b_report_valid) {
    //    udi_hid_raw_send_report();		// retrigger if more data
    //}
}

static void udi_hid_raw_setreport_valid(void) {}


static void udi_hid_raw_report_out_received(udd_ep_status_t status,
		iram_size_t nb_received, udd_ep_id_t ep)
{
	UNUSED(ep);
	if (UDD_EP_TRANSFER_OK != status)
		return;	// Abort reception

	if (sizeof(udi_hid_raw_report_out) == nb_received) {
		// need to turn off IRQs?
		memcpy( udi_hid_raw_report_out_cp, udi_hid_raw_report_out, sizeof(udi_hid_raw_report_out ));	// Make a copy of report (necessary?)
		raw_hid_receive( udi_hid_raw_report_out_cp, RAW_EPSIZE );
	}
	udi_hid_raw_report_out_enable();
}

static bool udi_hid_raw_report_out_enable(void)
{
	return udd_ep_run(UDI_HID_RAW_EP_OUT,
							false,
							(uint8_t *) &udi_hid_raw_report_out,
							sizeof(udi_hid_raw_report_out),
							udi_hid_raw_report_out_received);
}

